Revit 2027 API
BuiltInFailures.EditingFailures.ElementNotEditable Property
 One or more elements are not editable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementNotEditable { get; }
Public Shared ReadOnly Property ElementNotEditable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementNotEditable {
	FailureDefinitionId^ get ();
}
static member ElementNotEditable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace